const calcData = {
    typeSpec: [
        {name: 'Эвакуатор', price: '0'},
        {name: 'Манипулятор', price: '1'}
    ],
    typeCars: [
        {name: 'Малолитражные', price: [1600, 4500]},
        {name: 'Легковые иномарки', price: [1800, 4700]},
        {name: 'Легковые грузовики', price: [2200, 5500]},
        {name: 'Легковые отечественные', price: [1700, 4500]},
        {name: 'Внедорожники', price: [1900, 5000]},
        {name: 'Спецтехника', price: [2400, 6000]}
    ],
    wheelsLocked: [
        0, 1, 2, 3, 4
    ],
    blockings: [
        {name: 'Руль заблокирован', price: '350'}
        // {name: 'КПП заблокировано', price: '650'}
    ],
    distance: [
        {name: 'По Москве', price: '0'},
        {name: 'За МКАД 5км', price: '175'},
        {name: 'За МКАД 10км', price: '350'},
        {name: 'За МКАД 15км', price: '525'},
        {name: 'За МКАД 20км', price: '700'},
        {name: 'За МКАД 25км', price: '675'},
        {name: 'За МКАД 30км', price: '1050'},
        {name: 'За МКАД 35км', price: '1225'},
        {name: 'За МКАД 40км', price: '1400'},
        {name: 'За МКАД 45км', price: '1575'},
        {name: 'За МКАД 50км', price: '1750'},
        {name: 'За МКАД 55км', price: '1925'}
    ],
    time: [
        {name: 'Срочный заказ (выезд в течение 30 минут)', price: '0'},
        {name: 'Счастливые часы (выезд к 9:00 и 21:00 - скидка 9%)', price: '1'}
    ],
    selected: {
    	typeCars: 0,
        time: 1,
        wheels: 0,
        distance: 0,
        blockings: [],
        specCars: 0,
    },
    sum: 0
};

const calc = new Vue({
    el: '#calc',
    data: calcData,
    computed: {
        result: function() {
            let type_cars = this.typeCars[this.selected.typeCars]['price'][this.selected.specCars],
                wheels = this.wheelsLocked[this.selected.wheels] * 350,
                blockings =  Number(this.selected.blockings),
                distance = Number(this.selected.distance);

            let sum = type_cars + wheels + distance + blockings;
            if (this.selected.time == 1) sum = sum - (sum * 0.09);
            sum = Math.round(sum / 100) * 100;
            return sum;
        }
    }
});


// document.querySelector(".calculator__btn-order").onclick = function(){
//     let calc__result = (document.querySelector('.calculator__result')).innerHTML;
// 	console.log(calc__result);
// 	let popup = document.querySelector("popmake-26");
// 	popup.setAttribute('data-price-service', calc__result);
// // 	element.setAttribute(name, value);
// };



document.querySelector(".calculator__btn-order").onclick = function(){
    let calc__result = (document.querySelector('.calculator__result')).innerHTML;
	alert(calc__result);
	 };

// document.querySelector(".calculator__btn-order").onclick = function(){
//         	console.log((document.querySelector('.calculator__result')).innerHTML);
// };


// /* === Header === */
// let burger_btn = document.querySelector('.burger'),
//     menu = document.querySelector('.menu');

// burger_btn.addEventListener('click', function() {
//     this
//         .classList
//         .toggle('burger--active');

//     menu
//         .classList
//         .toggle('menu--open');
// });


// const timer = new Vue({
//     el: '#timer',
//     data: {
//         timer: null,
//         currentTime: 0,
//         initialTime: [
//             0, 11, 13
//         ],
//         currentTime: null
//     },

//     mounted() {
//         this.translSeconds();
//         this.playTimer();
//     },

//     methods: {
//         translSeconds: function() {
//             this.currentTime =  this.initialTime[0] * 3600 + this.initialTime[1] * 60 + this.initialTime[2];
//         },
//         playTimer: function() {
//             this.timer = setInterval(() => {
//                 this.currentTime--;
//                 if (this.currentTime < 1) this.removeTimer();
//             }, 1000)
//         },
//         removeTimer: function() {
//             clearInterval(this.timer);
//         }
//     },

//     computed: {
//         textSeconds: function() {
//             let seconds = this.currentTime%60;
//             return seconds < 10 ? `0${seconds}` : seconds;
//         },
//         textMinutes: function() {
//             let minutes = Math.trunc(this.currentTime/60%60);
//             return minutes < 10 ? `0${minutes}` : minutes;
//         },
//         textHourse: function() {
//             let hourse = Math.trunc(this.currentTime/60/60%60);
//             return hourse < 10 ? `0${hourse}` : hourse;
//         }
//     }
// });

 
//     const app_map = new Vue ({
    
//         el : "#svg_map",
//         data : {
//             message: 'popal',
//             paths:[
//             {d: "m 0,0 5,2 2,-1 4,0 8,3 3,0 3,-6 5,0 8,2 6,7 10,-6 6,0 3,-6 21,-15 4,1 3,-3 0,-3 9,-8 -5,-6 7,0 1,-5 3,-4 -5,-19 -8,0 -2,7 -5,6 -3,3 -5,-1 -7,4 -3,-3 -2,-4 -3,0 -2,-7 0,-5 -3,-8 6,-7 4,0 0,-11 -14,0 0,7 -8,3 -2,-4 -4,2 0,6 -6,0 -4,3 -2,-3 -8,5 -6,-2 -2,6 0,14 0,9 -1,5 0,5 5,6 -1,8 L 0,0 Z", name : "СЕВЕРО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000", transform : "translate(91,727)", css_class : "first_path", css_okrug : "SZAO"},
//             {d: "m 0,0 5,2 2,-1 4,0 8,3 3,0 3,-6 5,0 8,2 6,7 10,-6 6,0 3,-6 21,-15 4,1 3,-3 0,-3 9,-8 -5,-6 7,0 1,-5 3,-4 -5,-19 -8,0 -2,7 -5,6 -3,3 -5,-1 -7,4 -3,-3 -2,-4 -3,0 -2,-7 0,-5 -3,-8 6,-7 4,0 0,-11 -14,0 0,7 -8,3 -2,-4 -4,2 0,6 -6,0 -4,3 -2,-3 -8,5 -6,-2 -2,6 0,14 0,9 -1,5 0,5 5,6 -1,8 L 0,0 Z", name : "СЕВЕРО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000", transform : "translate(91,727)", css_class : "second_path", css_okrug : "SZAO"},

//             {d: "m 0,0 -3,5 -12,1 -5,-7 -5,4 -1,3 -3,2 -5,-7 15,-18 -3,-3 -5,3 -8,-6 6,-8 2,-6 4,0 0,4 6,4 15,-13 -10,-8 5,-8 -3,-3 2,-5 -5,-3 3,-3 -1,-6 8,0 1,-2 -4,-3 0,-6 -2,-3 5,-5 9,-7 13,-8 -8,-19 -6,1 -5,-2 -4,2 4,6 0,10 -12,0 -10,-5 -7,-6 -2,-3 0,-10 -5,-5 12,-4 -1,-4 -6,-1 4,-4 -2,-3 4,-6 0,-6 2,-7 4,1 5,0 5,8 9,5 10,-2 -2,-18 -2,-6 -3,-5 2,-2 -8,-18 -4,-4 -7,-1 -7,10 -4,-2 1,-7 0,-4 -5,-8 -9,-12 -9,-4 -2,-1 -1,-3 15,0 -1,8 7,-6 5,4 -2,2 8,10 8,9 2,3 0,-24 5,0 18,0 8,6 18,-2 8,3 6,0 9,-16 -2,-8 -5,-6 -7,-3 -7,-3 0,-4 6,-6 7,-3 8,2 8,8 2,11 0,12 3,5 6,0 20,-13 5,5 -8,15 -4,14 -1,12 -13,27 0,9 4,7 -1,3 -10,0 -2,3 3,2 -12,29 -7,18 0,6 -14,13 -8,-4 -2,3 -11,4 1,5 -5,9 -3,12 -7,3 -1,14 8,5 -4,6 2,7 3,8 6,-3 2,2 -3,7 -2,3 5,10 6,0 2,6 L 27,4 22,2 19,-1 10,-4 9,1 4,2 0,0 Z", name : "СЕВЕРО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "СЗАО", price: "1000", transform : "translate(281,638)", css_class : "first_path", css_okrug : "SZAO", x : "3%", y : "25%"},
//             {d: "m 0,0 -3,5 -12,1 -5,-7 -5,4 -1,3 -3,2 -5,-7 15,-18 -3,-3 -5,3 -8,-6 6,-8 2,-6 4,0 0,4 6,4 15,-13 -10,-8 5,-8 -3,-3 2,-5 -5,-3 3,-3 -1,-6 8,0 1,-2 -4,-3 0,-6 -2,-3 5,-5 9,-7 13,-8 -8,-19 -6,1 -5,-2 -4,2 4,6 0,10 -12,0 -10,-5 -7,-6 -2,-3 0,-10 -5,-5 12,-4 -1,-4 -6,-1 4,-4 -2,-3 4,-6 0,-6 2,-7 4,1 5,0 5,8 9,5 10,-2 -2,-18 -2,-6 -3,-5 2,-2 -8,-18 -4,-4 -7,-1 -7,10 -4,-2 1,-7 0,-4 -5,-8 -9,-12 -9,-4 -2,-1 -1,-3 15,0 -1,8 7,-6 5,4 -2,2 8,10 8,9 2,3 0,-24 5,0 18,0 8,6 18,-2 8,3 6,0 9,-16 -2,-8 -5,-6 -7,-3 -7,-3 0,-4 6,-6 7,-3 8,2 8,8 2,11 0,12 3,5 6,0 20,-13 5,5 -8,15 -4,14 -1,12 -13,27 0,9 4,7 -1,3 -10,0 -2,3 3,2 -12,29 -7,18 0,6 -14,13 -8,-4 -2,3 -11,4 1,5 -5,9 -3,12 -7,3 -1,14 8,5 -4,6 2,7 3,8 6,-3 2,2 -3,7 -2,3 5,10 6,0 2,6 L 27,4 22,2 19,-1 10,-4 9,1 4,2 0,0 Z", name : "СЕВЕРО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000", transform : "translate(281,638)", css_class : "second_path", css_okrug : "SZAO"},
//             {d: "m 0,0 5,4 0,2 18,0 14,8 3,0 22,18 14,8 3,-6 7,-6 10,-7 3,-6 2,-19 4,-16 1,-25 3,-9 -3,-6 -1,-15 6,-16 2,-3 -2,-3 1,-12 2,-7 2,-2 -2,-13 -3,-6 -6,-3 -12,-2 -8,-2 -6,-3 -5,-7 -5,-6 -4,2 -8,15 -4,14 -1,12 -13,27 0,9 4,7 -1,3 -10,0 -2,3 3,2 -19,47 0,6 L 0,0 Z", name : "СЕВЕРНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "САО", price: "1000", transform : "translate(324,539)", css_class : "first_path", css_okrug : "SAO", x : "7%", y : "7%"},
//             {d: "m 0,0 5,4 0,2 18,0 14,8 3,0 22,18 14,8 3,-6 7,-6 10,-7 3,-6 2,-19 4,-16 1,-25 3,-9 -3,-6 -1,-15 6,-16 2,-3 -2,-3 1,-12 2,-7 2,-2 -2,-13 -3,-6 -6,-3 -12,-2 -8,-2 -6,-3 -5,-7 -5,-6 -4,2 -8,15 -4,14 -1,12 -13,27 0,9 4,7 -1,3 -10,0 -2,3 3,2 -19,47 0,6 L 0,0 Z", transform : "translate(324,539)", css_class : "second_path", css_okrug : "SAO"},

//             {d: "m 0,0 -13,46 17,5 -3,10 9,4 7,-7 3,0 0,-22 -2,-25 0,-8 7,1 15,0 18,-10 22,-7 22,-3 4,2 4,-3 7,0 3,2 13,-9 9,-7 6,0 0,-5 3,-5 -4,-6 -6,0 -15,-17 15,0 0,-12 -4,-7 -14,2 -2,7 -3,3 -3,-2 3,-2 -2,-3 3,-3 -9,-8 -2,-4 -1,-1 -4,0 0,-18 -6,-16 -8,-17 0,-15 -13,10 0,-8 -14,1 0,-10 -3,-3 -4,0 -5,5 -2,7 -8,0 -2,2 -2,7 -1,12 2,3 -2,3 -6,16 1,15 3,6 -3,9 -1,25 -4,16 -2,19 -3,6 -10,7 -7,6 -3,6 z", name : "СЕВЕРО-ВОСТОЧНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "СВАО", price: "1000", transform : "translate(400,579)", css_class : "first_path", css_okrug : "SVAO", x : "7%", y : "10%"},
//             {d: "m 0,0 -13,46 17,5 -3,10 9,4 7,-7 3,0 0,-22 -2,-25 0,-8 7,1 15,0 18,-10 22,-7 22,-3 4,2 4,-3 7,0 3,2 13,-9 9,-7 6,0 0,-5 3,-5 -4,-6 -6,0 -15,-17 15,0 0,-12 -4,-7 -14,2 -2,7 -3,3 -3,-2 3,-2 -2,-3 3,-3 -9,-8 -2,-4 -1,-1 -4,0 0,-18 -6,-16 -8,-17 0,-15 -13,10 0,-8 -14,1 0,-10 -3,-3 -4,0 -5,5 -2,7 -8,0 -2,2 -2,7 -1,12 2,3 -2,3 -6,16 1,15 3,6 -3,9 -1,25 -4,16 -2,19 -3,6 -10,7 -7,6 -3,6 z", transform : "translate(400,579)", css_class : "second_path"},
//             {d: "m 0,0 42,-37 29,-26 4,0 10,-24 11,8 8,4 0,3 5,2 1,-1 -3,-4 1,-3 11,0 8,-4 -1,-4 -3,0 -6,5 -10,-11 -1,-6 -2,5 -6,-1 -4,-3 -9,9 -3,0 2,-45 3,-2 -2,-6 0,-36 3,-4 18,4 10,3 4,3 1,-3 -2,-2 2,-7 -4,0 -10,-6 -6,-5 -4,-11 7,-5 7,0 0,-3 3,-2 4,1 1,5 5,0 15,4 6,5 7,-2 6,-4 5,-7 -7,-6 -6,0 -2,-3 0,-4 -5,-5 -15,-1 -13,-7 -8,-9 -7,6 -33,22 -34,19 -9,9 -11,4 -10,9 -12,7 -3,8 3,9 -2,9 -4,6 -4,8 -3,2 -10,0 -23,7 -7,4 0,15 8,17 6,16 0,18 4,0 1,1 2,4 9,8 -3,3 2,3 -3,2 3,2 3,-3 2,-7 14,-2 4,7 0,12 -15,0 15,17 6,0 4,6 z", name : "ВОСТОЧНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "ВАО", price: "1000", transform : "translate(551,538)", css_class : "first_path", css_okrug : "VAO", x : "0%", y : "14%"},
//             {d: "m 0,0 42,-37 29,-26 4,0 10,-24 11,8 8,4 0,3 5,2 1,-1 -3,-4 1,-3 11,0 8,-4 -1,-4 -3,0 -6,5 -10,-11 -1,-6 -2,5 -6,-1 -4,-3 -9,9 -3,0 2,-45 3,-2 -2,-6 0,-36 3,-4 18,4 10,3 4,3 1,-3 -2,-2 2,-7 -4,0 -10,-6 -6,-5 -4,-11 7,-5 7,0 0,-3 3,-2 4,1 1,5 5,0 15,4 6,5 7,-2 6,-4 5,-7 -7,-6 -6,0 -2,-3 0,-4 -5,-5 -15,-1 -13,-7 -8,-9 -7,6 -33,22 -34,19 -9,9 -11,4 -10,9 -12,7 -3,8 3,9 -2,9 -4,6 -4,8 -3,2 -10,0 -23,7 -7,4 0,15 8,17 6,16 0,18 4,0 1,1 2,4 9,8 -3,3 2,3 -3,2 3,2 3,-3 2,-7 14,-2 4,7 0,12 -15,0 15,17 6,0 4,6 z", transform : "translate(551,538)", css_class : "second_path", css_okrug : "VAO"},
//                         {d: "m 0,0 5,5 4,-2 5,6 5,7 6,3 8,2 12,2 6,3 3,6 2,13 8,0 2,-7 5,-5 4,0 3,3 0,10 14,-1 0,8 13,-10 7,-4 23,-7 10,0 3,-2 4,-8 -12,-10 -4,3 -4,-4 -3,-9 -9,0 0,-12 12,-7 8,-7 0,-8 -3,-8 -6,5 0,-5 -11,-5 -4,9 -4,-3 1,-5 -7,3 -6,1 -1,-8 -6,0 -4,-2 -10,-2 -7,0 -2,-1 -8,4 -3,-3 -3,-9 -1,-4 -4,0 -3,4 -12,-5 -6,1 -6,3 -3,6 0,10 4,4 10,7 8,9 2,7 0,9 -2,2 -9,0 -9,-6 -6,-5 -9,0 -5,5 -4,10 -1,4 z", name : "ЦЕНТРАЛЬНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "ЦАО", price: "1000", transform : "translate(384,376)", css_class : "first_path", css_okrug : "CHAO", x : "8%", y : "2%"},
//             {d: "m 0,0 5,5 4,-2 5,6 5,7 6,3 8,2 12,2 6,3 3,6 2,13 8,0 2,-7 5,-5 4,0 3,3 0,10 14,-1 0,8 13,-10 7,-4 23,-7 10,0 3,-2 4,-8 -12,-10 -4,3 -4,-4 -3,-9 -9,0 0,-12 12,-7 8,-7 0,-8 -3,-8 -6,5 0,-5 -11,-5 -4,9 -4,-3 1,-5 -7,3 -6,1 -1,-8 -6,0 -4,-2 -10,-2 -7,0 -2,-1 -8,4 -3,-3 -3,-9 -1,-4 -4,0 -3,4 -12,-5 -6,1 -6,3 -3,6 0,10 4,4 10,7 8,9 2,7 0,9 -2,2 -9,0 -9,-6 -6,-5 -9,0 -5,5 -4,10 -1,4 z",  transform : "translate(384,376)", css_class : "second_path"},
//                         {d: "m 0,0 -1,5 4,3 4,-9 11,5 0,5 6,-5 3,8 0,8 -8,7 -12,7 0,12 9,0 3,9 4,4 4,-3 12,10 4,-6 2,-9 -3,-9 3,-8 12,-7 10,-9 11,-4 9,-9 34,-19 33,-22 -3,-4 5,-4 -3,-3 3,-3 -6,-18 -19,14 -1,-1 3,-14 4,-25 -5,-8 -10,-15 -22,-22 -5,13 0,21 -6,0 -23,-11 -31,0 -14,6 -11,8 -3,6 2,15 7,7 20,10 3,7 -1,7 -8,7 -12,4 -6,0 -8,5 -1,17 -3,17 z", name : "ЮГО-ВОСТОЧНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "ЮВАО", price: "1000", transform : "translate(497,332)", css_class : "first_path", css_okrug : "UVAO", x : "8%", y : "6%"},
//             {d: "m 0,0 -1,5 4,3 4,-9 11,5 0,5 6,-5 3,8 0,8 -8,7 -12,7 0,12 9,0 3,9 4,4 4,-3 12,10 4,-6 2,-9 -3,-9 3,-8 12,-7 10,-9 11,-4 9,-9 34,-19 33,-22 -3,-4 5,-4 -3,-3 3,-3 -6,-18 -19,14 -1,-1 3,-14 4,-25 -5,-8 -10,-15 -22,-22 -5,13 0,21 -6,0 -23,-11 -31,0 -14,6 -11,8 -3,6 2,15 7,7 20,10 3,7 -1,7 -8,7 -12,4 -6,0 -8,5 -1,17 -3,17 z", name : "ЮГО-ВОСТОЧНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ",  price: "1000", transform : "translate(497,332)", css_class : "second_path"},

//             {d: "m 0,0 23,0 8,6 18,-2 8,3 6,0 9,-16 -2,-8 -5,-6 -14,-6 0,-4 6,-6 7,-3 8,2 8,8 2,10 0,13 3,5 6,0 20,-13 1,-4 4,-10 5,-5 9,0 15,11 9,0 2,-2 0,-9 -2,-7 -8,-9 -10,-7 -4,-4 0,-10 3,-6 6,-3 6,-1 -5,-3 -15,-20 -18,-18 9,-9 -11,-13 -16,-15 -23,-19 -14,22 -5,7 -7,1 -8,-2 0,-4 2,-3 -3,-4 1,-4 3,-2 0,-10 -7,-13 -7,1 -3,-3 -6,0 -2,5 -8,-9 -4,0 -3,6 -5,0 0,6 -6,2 -5,-3 -5,0 -6,7 0,6 3,11 5,4 0,3 2,0 1,5 -2,2 4,2 0,3 3,0 2,-3 7,6 4,0 0,-10 7,0 0,8 7,0 3,-6 7,0 11,3 0,3 -7,7 -1,4 3,0 0,4 7,5 -4,15 -21,28 0,6 -9,27 -3,16 0,17 -2,4 0,8 3,2 z", name : "ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "ЗАО", price: "1000", transform : "translate(273,393)", css_class : "first_path", css_okrug : "ZAO", x : "7%", y : "11%"},
//             {d: "m 0,0 23,0 8,6 18,-2 8,3 6,0 9,-16 -2,-8 -5,-6 -14,-6 0,-4 6,-6 7,-3 8,2 8,8 2,10 0,13 3,5 6,0 20,-13 1,-4 4,-10 5,-5 9,0 15,11 9,0 2,-2 0,-9 -2,-7 -8,-9 -10,-7 -4,-4 0,-10 3,-6 6,-3 6,-1 -5,-3 -15,-20 -18,-18 9,-9 -11,-13 -16,-15 -23,-19 -14,22 -5,7 -7,1 -8,-2 0,-4 2,-3 -3,-4 1,-4 3,-2 0,-10 -7,-13 -7,1 -3,-3 -6,0 -2,5 -8,-9 -4,0 -3,6 -5,0 0,6 -6,2 -5,-3 -5,0 -6,7 0,6 3,11 5,4 0,3 2,0 1,5 -2,2 4,2 0,3 3,0 2,-3 7,6 4,0 0,-10 7,0 0,8 7,0 3,-6 7,0 11,3 0,3 -7,7 -1,4 3,0 0,4 7,5 -4,15 -21,28 0,6 -9,27 -3,16 0,17 -2,4 0,8 3,2 z", name : "ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", transform : "translate(273,393)",price: "1000", css_class : "second_path", css_okrug : "ZAO"},

//             {d: "m 0,0 24,20 15,14 11,13 -9,9 18,18 15,20 5,3 12,5 3,-4 2,0 0,-3 13,-22 3,-4 0,-5 2,-2 5,0 0,-2 1,0 0,-4 -1,0 -6,-9 0,-5 3,-4 -3,-3 6,-1 -5,-8 -1,-3 0,-19 -8,1 -12,3 1,-4 0,-6 -4,-4 0,-3 10,-1 -7,-10 -4,-5 5,-4 -5,-6 0,-4 -3,-3 8,-6 -3,-21 -2,-10 11,-5 6,-9 2,-5 2,-4 -9,-8 -3,-14 1,-3 -3,-8 0,-8 -3,-15 15,-19 -2,-4 -3,0 0,-8 -6,-2 -9,8 3,18 -9,-1 -6,-3 -6,-3 7,-5 -2,-4 -8,0 -6,-5 -8,0 2,8 6,6 0,5 -10,9 -11,6 -9,0 -8,5 -7,-6 -3,0 1,16 9,6 4,-3 32,18 10,0 4,9 -2,3 1,7 -10,6 2,4 -4,1 1,5 4,-1 6,2 -4,9 -14,6 L 38,-55 27,-40 0,0 Z", name : "ЮГО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "ЮЗАО", price: "1000", transform : "translate(341,213)", css_class : "first_path", css_okrug : " UZAO", x : "4%", y : "1%"},
//             {d: "m 0,0 24,20 15,14 11,13 -9,9 18,18 15,20 5,3 12,5 3,-4 2,0 0,-3 13,-22 3,-4 0,-5 2,-2 5,0 0,-2 1,0 0,-4 -1,0 -6,-9 0,-5 3,-4 -3,-3 6,-1 -5,-8 -1,-3 0,-19 -8,1 -12,3 1,-4 0,-6 -4,-4 0,-3 10,-1 -7,-10 -4,-5 5,-4 -5,-6 0,-4 -3,-3 8,-6 -3,-21 -2,-10 11,-5 6,-9 2,-5 2,-4 -9,-8 -3,-14 1,-3 -3,-8 0,-8 -3,-15 15,-19 -2,-4 -3,0 0,-8 -6,-2 -9,8 3,18 -9,-1 -6,-3 -6,-3 7,-5 -2,-4 -8,0 -6,-5 -8,0 2,8 6,6 0,5 -10,9 -11,6 -9,0 -8,5 -7,-6 -3,0 1,16 9,6 4,-3 32,18 10,0 4,9 -2,3 1,7 -10,6 2,4 -4,1 1,5 4,-1 6,2 -4,9 -14,6 L 38,-55 27,-40 0,0 Z", name : "ЮГО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000", transform : "translate(341,213)", css_class : "second_path", css_okrug : " UZAO"},
           
          




//             {d: "m 0,0 -4,9 -6,9 -11,5 2,10 3,21 -8,6 3,3 0,4 5,6 -5,4 6,8 5,7 -10,1 0,3 4,4 0,6 -1,4 12,-3 8,-1 0,19 1,3 5,8 -6,1 3,3 -3,4 0,5 6,9 1,0 0,4 -1,0 0,2 -5,0 -2,2 0,5 -3,4 -13,22 0,3 2,0 1,4 3,9 3,3 8,-4 2,1 7,0 10,2 4,2 6,0 1,8 6,-1 7,-3 3,-17 1,-17 8,-5 6,0 12,-4 8,-7 1,-7 -3,-7 -20,-10 -7,-7 -2,-15 3,-6 11,-8 14,-6 31,0 23,11 6,0 0,-21 5,-13 L 132,67 108,44 100,37 72,19 70,17 66,17 58,12 42,12 13,15 -1,16 -2,14 0,0 Z", name : "ЮЖНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "ЮАО", price: "1000", transform : "translate(451,111)", css_class : "first_path", css_okrug : " UAO", x : "3%", y : "-8%"},
//             {d: "m 0,0 -4,9 -6,9 -11,5 2,10 3,21 -8,6 3,3 0,4 5,6 -5,4 6,8 5,7 -10,1 0,3 4,4 0,6 -1,4 12,-3 8,-1 0,19 1,3 5,8 -6,1 3,3 -3,4 0,5 6,9 1,0 0,4 -1,0 0,2 -5,0 -2,2 0,5 -3,4 -13,22 0,3 2,0 1,4 3,9 3,3 8,-4 2,1 7,0 10,2 4,2 6,0 1,8 6,-1 7,-3 3,-17 1,-17 8,-5 6,0 12,-4 8,-7 1,-7 -3,-7 -20,-10 -7,-7 -2,-15 3,-6 11,-8 14,-6 31,0 23,11 6,0 0,-21 5,-13 L 132,67 108,44 100,37 72,19 70,17 66,17 58,12 42,12 13,15 -1,16 -2,14 0,0 Z", transform : "translate(451,111)", css_class : "second_path", css_okrug : " UAO"},

//             //{d: "m 0,0 -4,9 -6,9 -11,5 2,10 3,21 -8,6 3,3 0,4 5,6 -5,4 6,8 5,7 -10,1 0,3 4,4 0,6 -1,4 12,-3 8,-1 0,19 1,3 5,8 -6,1 3,3 -3,4 0,5 6,9 1,0 0,4 -1,0 0,2 -5,0 -2,2 0,5 -3,4 -13,22 0,3 2,0 1,4 3,9 3,3 8,-4 2,1 7,0 10,2 4,2 6,0 1,8 6,-1 7,-3 3,-17 1,-17 8,-5 6,0 12,-4 8,-7 1,-7 -3,-7 -20,-10 -7,-7 -2,-15 3,-6 11,-8 14,-6 31,0 23,11 6,0 0,-21 5,-13 L 132,67 108,44 100,37 72,19 70,17 66,17 58,12 42,12 13,15 -1,16 -2,14 0,0 Z", name : "СЕВЕРО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", caption: "СЗАО", price: "1000", transform : "translate(451,111)", css_class : "first_path"},

//             {d: "m 0,0 -4,9 -6,9 -11,5 2,10 3,21 -8,6 3,3 0,4 5,6 -5,4 6,8 5,7 -10,1 0,3 4,4 0,6 -1,4 12,-3 8,-1 0,19 1,3 5,8 -6,1 3,3 -3,4 0,5 6,9 1,0 0,4 -1,0 0,2 -5,0 -2,2 0,5 -3,4 -13,22 0,3 2,0 1,4 3,9 3,3 8,-4 2,1 7,0 10,2 4,2 6,0 1,8 6,-1 7,-3 3,-17 1,-17 8,-5 6,0 12,-4 8,-7 1,-7 -3,-7 -20,-10 -7,-7 -2,-15 3,-6 11,-8 14,-6 31,0 23,11 6,0 0,-21 5,-13 L 132,67 108,44 100,37 72,19 70,17 66,17 58,12 42,12 13,15 -1,16 -2,14 0,0 Z", name : "СЕВЕРО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000", transform : "translate(451,111)", css_class : "second_path", css_okrug : " UAO"},
//             {d: "m 0,0 -10,-7 4,-6 -3,-3 -1,-6 -4,-3 -1,-5 -4,-4 3,-6 -5,-1 0,-7 5,3 5,-5 51,23 -5,8 1,4 5,3 0,4 -7,8 -6,0 -3,-6 -3,3 -6,-2 0,5 -3,-2 -4,3 -7,-8 -2,3 0,4 z", name : "ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000", transform : "translate(189,187)", css_class : "first_path", css_okrug : "ZAO"},
//             {d: "m 0,0 -10,-7 4,-6 -3,-3 -1,-6 -4,-3 -1,-5 -4,-4 3,-6 -5,-1 0,-7 5,3 5,-5 51,23 -5,8 1,4 5,3 0,4 -7,8 -6,0 -3,-6 -3,3 -6,-2 0,5 -3,-2 -4,3 -7,-8 -2,3 0,4 z", name : "ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000", transform : "translate(189,187)", css_class : "second_path", css_okrug : "ZAO"},
//             {d: "m 0,0 8,-6 2,-5 -5,-6 -3,-1 -2,-4 -8,5 -9,-3 -3,4 9,11 4,3 7,2 z", name : "ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000" , transform : "translate(152,188)", css_class : "first_path", css_okrug : "ZAO"},
//             {d: "m 0,0 8,-6 2,-5 -5,-6 -3,-1 -2,-4 -8,5 -9,-3 -3,4 9,11 4,3 7,2 z", name : "ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000", transform : "translate(152,188)", css_class : "second_path", css_okrug : "ZAO"},
            
//             {d: "m 0,0 -3,9 c 0,0 4,6 5,7 1,1 13,6 13,6 l 13,2 7,0 12,-3 6,-5 L 50,10 37,1 27,-2 21,-1 19,5 8,1 0,0 Z", name : "СЕВЕРО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", price: "1000" , transform : "translate(282,655)", css_class : "first_path", css_okrug : "SZAO"},
//             {d: "m 0,0 -3,9 c 0,0 4,6 5,7 1,1 13,6 13,6 l 13,2 7,0 12,-3 6,-5 L 50,10 37,1 27,-2 21,-1 19,5 8,1 0,0 Z" , name : "СЕВЕРО-ЗАПАДНЫЙ АДМИНИСТРАТИВНЫЙ ОКРУГ", transform : "translate(282,655)", price: "1000", css_class : "second_path", css_okrug : "SZAO"},


//             ],
            
//             isActive: false,
//             isActive_2: false,
//             isActiveTolltip: false,
//             currentModal: null,
//             currentOkr: {
//                 name: null,
//                 price: null
//             }

//         },

//         methods: {
//             activeOkr: function(i) {
                

//                 if (this.paths[i]['css_okrug'] == "SZAO") {
//                     let listClass = this.isActive == false ? 'szao' : 'szao active';
//                     return listClass;
//                 }
//                 if (this.paths[i]['css_okrug'] == "ZAO") {
//                     let listClass = this.isActive_2 == false ? 'zao' : 'zao active';
//                     return listClass;
//                 }
//             },

//             removeClass(event) {
//                 this.currentModal = null;
//                 if (event.target.dataset.okrug == 'SZAO') { 
//                   if (this.isActive == true) this.isActive = false;
//                 }
//                 if (event.target.dataset.okrug == 'ZAO') { 
//                   if (this.isActive_2 == true) this.isActive_2 = false;
//                 }
//             },

//             checkPath: function(message, event, i) {
//                 this.currentModal = i;

//                 if (event.target.dataset.okrug == 'SZAO') {
//                     this.isActive = true;
//                     // console.log(this.stateOkrug.szao, event.target);
//                 }

//                 if (event.target.dataset.okrug == 'ZAO') {
//                     this.isActive_2 = true;
//                     // console.log(this.stateOkrug.szao, event.target);
//                 }

//                 // document.getElementById("p2").style.color = "blue";
//                 // if (event.target.dataset.okrug == 'ZAO') {
//                 //     console.log(message, event.target);
//                 // }
//             },
//             open_model(i, event) {
//                 this.currentOkr.name = this.paths[i].name;
//                 this.currentOkr.price = this.paths[i].price;
//                 $('#ex2 .name_modal').html('<img src="/img/circle_map.svg" style="width:20px;margin-right:10px;"><span style="font-size:20px;margin-bottom:14px;">Заказать эвакуатор в </span><br><u>'+this.currentOkr.name+'</u>');
//                 $('#ex2 .price_modal').text('Стоимость от: '+this.currentOkr.price+' руб.');
//                 $("#ex2").modal({ });
//         }
//     }
// });